# SQLAlchemy: SQL and ORM

We will follow a series of exercises to get familiar with SQL and ORM.

ORM can be an abstract concept, to help you compare, the exercises will be a combination of traditional queries and SQLAlchemy queries.

`SQLAlchemy` is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL.

It provides a full suite of well known enterprise-level persistence patterns, designed for efficient and high-performing database access, adapted into a simple and Pythonic domain language.

Installing The Package:

```pip install sqlalchemy```

## Setting up your notebook
To facilitate developing, you can run this notebook on a [Google Colab](https://colab.research.google.com/).

In [2]:
# Load the SQL magic extension
# https://github.com/ploomber/jupysql
# this extension allows us to connect to DBs and issue SQL commands
%load_ext sql

In [3]:
# To run SQL code in a Jupyter notebook cell, you can use the magic command %%sql

In [4]:
%%sql
SELECT sqlite_version();

UsageError: No active connection.

To fix it:

Pass a valid connection string:
    Example: %sql postgresql://username:password@hostname/dbname

OR

Set the environment variable $DATABASE_URL

For more details, see: https://jupysql.ploomber.io/en/latest/connecting.html
If you need help solving this issue, send us a message: https://ploomber.io/community

After running the previous cell, we encounter the error `UsageError: No active connection.` This is due to the fact a connection with a database has not been established.

## Create a database with SQL Alchemy

The ***Declarative Mapping*** is the typical way that mappings are constructed in modern SQLAlchemy. Read more: [Declarative mapping and alternatives](https://docs.sqlalchemy.org/en/14/orm/mapping_styles.html#orm-declarative-mapping).

In [5]:
from sqlalchemy import Column, Integer, String, ForeignKey
from sqlalchemy.orm import declarative_base
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

# declarative base class
Base = declarative_base()

# an example mapping using the base
class User(Base):
    __tablename__ = 'user'

    id = Column(Integer, primary_key=True)
    name = Column(String)
    fullname = Column(String)
    nickname = Column(String)

The `Engine` is the starting point for any SQLAlchemy application, it represents a Python object that can be used to interact directly with the database and can be passed to a Session object to work with the ORM,

The `create_engine()`  function produces an `Engine` object based on a URL.

In [6]:
engine = create_engine('sqlite:///MyDataBase.db')

*Note the use of `///` to indicate a relative file path.*

In [7]:
print(type(engine))

#create_engine() is a function provided by SQLAlchemy that creates a new Engine instance, which is a central object used to manage connections to a database.

<class 'sqlalchemy.engine.base.Engine'>

The typical form of a database URL is:
`dialect+driver://username:password@host:port/database`

In this case we are using [SQLite](https://www.sqlite.org/index.html) a database engine broadly used worldwide for desktop and mobile aplications and provides the advantage of containing the database into one file `DB.db`.

Among the supported databases on sql alchemy we can list:

- SQLite
- PosgreSQL
- MySQL
- Oracle
- Microsoft SQL Server

The `Table object` is a member of a larger collection known as `MetaData`. When using Declarative, this object is available using the `.metadata attribute` of our declarative base class.

The `MetaData` is a registry which includes the ability to emit a limited set of schema generation commands to the database. As our database does not actually have a users table present, we can use `MetaData` to issue CREATE TABLE statements to the database for all tables that don’t yet exist.

In [8]:
# Create database following parameters defined in `Base`
Base.metadata.create_all(engine)

Refresh local files of your working directory, now you should be able to see the file `MyDataBase.db`.

In [9]:
# Connecting to the database
%sql sqlite:///MyDataBase.db

Connecting to 'sqlite:///MyDataBase.db'

In [10]:
%%sql
-- # In SQL the comments are declared with --
-- # Example: Query to select values on table "user" from MyDataBase.db
SELECT * FROM user;

Running query in 'sqlite:///MyDataBase.db'

+----+---------------+-----------------------+----------------+
| id |      name     |        fullname       |    nickname    |
+----+---------------+-----------------------+----------------+
| 1  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 2  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 3  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 4  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 5  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 6  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 7  |    Jennifer   |    Jennifer Aniston   |     Rachel     |
| 8  | Tyrannosaurus |   Tyrannosaurus Rex   |     T-Rex      |
| 9  |      Neil     |  Neil Patrick Harris  | Barney Stinson |
| 10 |     Aegon     |    Aegon Targaryen    |   John Snow    |
+----+---------------+-----------------------+----------------+
Truncated to displaylimit of 10.

The table `user` declared previously on `class User(Base)` exist on the database but no data has been stored yet.

# Database sessions

A `DBSession()` instance establishes all conversations with the database during your session. 
- Any change made against the objects in the session won't be persisted into the database until you call: `session.commit()`. *(just like using Git...)*

- If you're not happy about the changes, you can revert all of them back to the last commit by calling `session.rollback()`.

In [11]:
# Bind the engine to the metadata of the Base class so that the
# declaratives can be accessed through a DBSession instance
Base.metadata.bind = engine
DBSession = sessionmaker(bind=engine)
session = DBSession()

## Insert information into table *ORM approach*

In [12]:
# Using `class User(Base)` to input new parameters into the table `user`
my_first_table = User(name="Arnold", fullname="Arnold Schwarzenegger", nickname="Terminator")

In [13]:
# Add and commit changes to table `user`
session.add(my_first_table)
session.commit()
print(my_first_table)

<__main__.User object at 0x76b32ebfc050>

`my_first_table` is a Python object, what means we can interact with the table in the same way done with other functions:

In [14]:
print(my_first_table.id)
print(my_first_table.name)
print(my_first_table.fullname)
print(my_first_table.nickname)

11
Arnold
Arnold Schwarzenegger
Terminator

## Insert information to table *using Queries*

Instead of using `class User(Base)`, we will add the values to the table using directly SQL queries. This, with the purpose of ilustrate with a pragmatical example the working methods using ORM vs SQL queries.

In [15]:
%%sql

-- # Insert values into the table `user`

INSERT INTO user(id, name, fullname, nickname)
    VALUES (7, 'Jennifer', 'Jennifer Aniston', 'Rachel'), 
    (8, 'Tyrannosaurus','Tyrannosaurus Rex', 'T-Rex'), 
    (9, 'Neil', 'Neil Patrick Harris', 'Barney Stinson'),
    (10, 'Aegon', 'Aegon Targaryen', 'John Snow');

Running query in 'sqlite:///MyDataBase.db'

RuntimeError: (sqlite3.IntegrityError) UNIQUE constraint failed: user.id
[SQL: INSERT INTO user(id, name, fullname, nickname)
    VALUES (7, 'Jennifer', 'Jennifer Aniston', 'Rachel'),
    (8, 'Tyrannosaurus','Tyrannosaurus Rex', 'T-Rex'),
    (9, 'Neil', 'Neil Patrick Harris', 'Barney Stinson'),
    (10, 'Aegon', 'Aegon Targaryen', 'John Snow');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)
If you need help solving this issue, send us a message: https://ploomber.io/community

To check your information was inserted correctly you can open your database or use one of the many VSCode extentions to view SQLite databases (e.g. SQL Viewer).

## Exercises: 

1. Use the `class User` to insert 5 rows of data into the table `user`
2. Insert 5 additional rows but this time using queries

In [19]:
## Your code: ORM Approach
user1 = User(name='Alice', fullname='Alice Wonderland', nickname='Wonder')
user2 = User(name='Bob', fullname='Bob Builder', nickname='Builder')
user3 = User(name='Charlie', fullname='Charlie Brown', nickname='Peanuts')
user4 = User(name='Diana', fullname='Diana Prince', nickname='Wonder Woman')
user5 = User(name='Eve', fullname='Eve Online', nickname='EVE')

session.add_all([user1, user2, user3, user4, user5])

session.commit()

all_users = session.query(User).all()
for user in all_users:
    print(f"ID: {user.id}, Name: {user.name}")

ID: 1, Name: Arnold
ID: 2, Name: Arnold
ID: 3, Name: Arnold
ID: 4, Name: Arnold
ID: 5, Name: Arnold
ID: 6, Name: Arnold
ID: 7, Name: Jennifer
ID: 8, Name: Tyrannosaurus
ID: 9, Name: Neil
ID: 10, Name: Aegon
ID: 11, Name: Arnold
ID: 12, Name: Alice
ID: 13, Name: Bob
ID: 14, Name: Charlie
ID: 15, Name: Diana
ID: 16, Name: Eve
ID: 17, Name: Alice
ID: 18, Name: Bob
ID: 19, Name: Charlie
ID: 20, Name: Diana
ID: 21, Name: Eve
ID: 22, Name: Alice
ID: 23, Name: Bob
ID: 24, Name: Charlie
ID: 25, Name: Diana
ID: 26, Name: Eve

In [20]:
%%sql

INSERT INTO user(id, name, fullname, nickname)
    VALUES (27, 'Maison', 'Jennifer Aniston', 'Rachel GTFO'), 
    (28, 'Houellebecq','Michel Rex', 'T-Rex Oh Yeah'), 
    (29, 'Erich', 'Neil Douglas Marcel Anderson', 'Sigmund Stinson'),
    (30, 'Thomas', 'Mikhail Targaryen', 'John Evil');

Running query in 'sqlite:///MyDataBase.db'

4 rows affected.

++
||
++
++

## Preview values in table

You can also preview the values in a particular table by using queries and the ORM approach.

### *Using queries:*

In [21]:
%%sql

SELECT * FROM user;

Running query in 'sqlite:///MyDataBase.db'

+----+---------------+-----------------------+----------------+
| id |      name     |        fullname       |    nickname    |
+----+---------------+-----------------------+----------------+
| 1  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 2  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 3  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 4  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 5  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 6  |     Arnold    | Arnold Schwarzenegger |   Terminator   |
| 7  |    Jennifer   |    Jennifer Aniston   |     Rachel     |
| 8  | Tyrannosaurus |   Tyrannosaurus Rex   |     T-Rex      |
| 9  |      Neil     |  Neil Patrick Harris  | Barney Stinson |
| 10 |     Aegon     |    Aegon Targaryen    |   John Snow    |
+----+---------------+-----------------------+----------------+
Truncated to displaylimit of 10.

### *ORM approach*:

The inspection module provides the `inspect()` function, which delivers runtime information about a wide variety of SQLAlchemy objects, both within the Core as well as the ORM.

The `inspect()` function is the entry point to SQLAlchemy’s public API for viewing the configuration and construction of in-memory objects. Read more: https://docs.sqlalchemy.org/en/20/core/inspection.html.

In [22]:
from sqlalchemy import inspect
inspector = inspect(engine)

# Get table information
print(inspector.get_table_names())

['user']

In [25]:
# Get values in table:

print("----> User by (name):")
query = session.query(User)
for _row in query.all():
    print(_row.id, _row.name, _row.fullname, _row.nickname)

----> User by (name):
1 Arnold Arnold Schwarzenegger Terminator
2 Arnold Arnold Schwarzenegger Terminator
3 Arnold Arnold Schwarzenegger Terminator
4 Arnold Arnold Schwarzenegger Terminator
5 Arnold Arnold Schwarzenegger Terminator
6 Arnold Arnold Schwarzenegger Terminator
7 Jennifer Jennifer Aniston Rachel
8 Tyrannosaurus Tyrannosaurus Rex T-Rex
9 Neil Neil Patrick Harris Barney Stinson
10 Aegon Aegon Targaryen John Snow
11 Arnold Arnold Schwarzenegger Terminator
12 Alice Alice Wonderland Wonder
13 Bob Bob Builder Builder
14 Charlie Charlie Brown Peanuts
15 Diana Diana Prince Wonder Woman
16 Eve Eve Online EVE
17 Alice Alice Wonderland Wonder
18 Bob Bob Builder Builder
19 Charlie Charlie Brown Peanuts
20 Diana Diana Prince Wonder Woman
21 Eve Eve Online EVE
22 Alice Alice Wonderland Wonder
23 Bob Bob Builder Builder
24 Charlie Charlie Brown Peanuts
25 Diana Diana Prince Wonder Woman
26 Eve Eve Online EVE
27 Maison Jennifer Aniston Rachel GTFO
28 Houellebecq Michel Rex T-Rex Oh Yeah
29 Erich Neil Douglas Marcel Anderson Sigmund Stinson
30 Thomas Mikhail Targaryen John Evil

### Exercises: 

1. Modify the code of the previous cell to stored the printed values on:

    a. A pandas DataFrame
    
    b. A dictionary

In [33]:
import pandas as pd

data = [{
    'id': row.id,
    'name': row.name,
    'fullname': row.fullname,
    'nickname': row.nickname
} for row in query.all()]

df = pd.DataFrame(data)

print("----> User Data in DataFrame:")
print(df)

data_dict = {
    'id': [],
    'name': [],
    'fullname': [],
    'nickname': []
}

for row in query.all():
    data_dict['id'].append(row.id)
    data_dict['name'].append(row.name)
    data_dict['fullname'].append(row.fullname)
    data_dict['nickname'].append(row.nickname)

print("----> User Data in Dictionary:")
print(data_dict)

----> User Data in DataFrame:
    id           name                      fullname         nickname
0    1         Arnold         Arnold Schwarzenegger       Terminator
1    2         Arnold         Arnold Schwarzenegger       Terminator
2    3         Arnold         Arnold Schwarzenegger       Terminator
3    4         Arnold         Arnold Schwarzenegger       Terminator
4    5         Arnold         Arnold Schwarzenegger       Terminator
5    6         Arnold         Arnold Schwarzenegger       Terminator
6    7       Jennifer              Jennifer Aniston           Rachel
7    8  Tyrannosaurus             Tyrannosaurus Rex            T-Rex
8    9           Neil           Neil Patrick Harris   Barney Stinson
9   10          Aegon               Aegon Targaryen        John Snow
10  11         Arnold         Arnold Schwarzenegger       Terminator
11  12          Alice              Alice Wonderland           Wonder
12  13            Bob                   Bob Builder          Builder
13  14        Charlie                 Charlie Brown          Peanuts
14  15          Diana                  Diana Prince     Wonder Woman
15  16            Eve                    Eve Online              EVE
16  17          Alice              Alice Wonderland           Wonder
17  18            Bob                   Bob Builder          Builder
18  19        Charlie                 Charlie Brown          Peanuts
19  20          Diana                  Diana Prince     Wonder Woman
20  21            Eve                    Eve Online              EVE
21  22          Alice              Alice Wonderland           Wonder
22  23            Bob                   Bob Builder          Builder
23  24        Charlie                 Charlie Brown          Peanuts
24  25          Diana                  Diana Prince     Wonder Woman
25  26            Eve                    Eve Online              EVE
26  27         Maison              Jennifer Aniston      Rachel GTFO
27  28    Houellebecq                    Michel Rex    T-Rex Oh Yeah
28  29          Erich  Neil Douglas Marcel Anderson  Sigmund Stinson
29  30         Thomas             Mikhail Targaryen        John Evil
----> User Data in Dictionary:
{'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30], 'name': ['Arnold', 'Arnold', 'Arnold', 'Arnold', 'Arnold', 'Arnold', 'Jennifer', 'Tyrannosaurus', 'Neil', 'Aegon', 'Arnold', 'Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Maison', 'Houellebecq', 'Erich', 'Thomas'], 'fullname': ['Arnold Schwarzenegger', 'Arnold Schwarzenegger', 'Arnold Schwarzenegger', 'Arnold Schwarzenegger', 'Arnold Schwarzenegger', 'Arnold Schwarzenegger', 'Jennifer Aniston', 'Tyrannosaurus Rex', 'Neil Patrick Harris', 'Aegon Targaryen', 'Arnold Schwarzenegger', 'Alice Wonderland', 'Bob Builder', 'Charlie Brown', 'Diana Prince', 'Eve Online', 'Alice Wonderland', 'Bob Builder', 'Charlie Brown', 'Diana Prince', 'Eve Online', 'Alice Wonderland', 'Bob Builder', 'Charlie Brown', 'Diana Prince', 'Eve Online', 'Jennifer Aniston', 'Michel Rex', 'Neil Douglas Marcel Anderson', 'Mikhail Targaryen'], 'nickname': ['Terminator', 'Terminator', 'Terminator', 'Terminator', 'Terminator', 'Terminator', 'Rachel', 'T-Rex', 'Barney Stinson', 'John Snow', 'Terminator', 'Wonder', 'Builder', 'Peanuts', 'Wonder Woman', 'EVE', 'Wonder', 'Builder', 'Peanuts', 'Wonder Woman', 'EVE', 'Wonder', 'Builder', 'Peanuts', 'Wonder Woman', 'EVE', 'Rachel GTFO', 'T-Rex Oh Yeah', 'Sigmund Stinson', 'John Evil']}

2. Insert new table using queries

In [34]:
%%sql

CREATE TABLE media (
    id          INTEGER PRIMARY KEY NOT NULL,
    production  TEXT NOT NULL,
    year        NUMBER NOT NULL
    );

Running query in 'sqlite:///MyDataBase.db'

++
||
++
++

In [35]:
%%sql
--# Insert values on table `media`
INSERT INTO media(id, production, year)
    VALUES (1,'Terminator',1984), 
    (2,'Friends', 1994), 
    (3,'Toy Story', 1995), 
    (4,'How I met your mother', 2005),
    (5,'Game of thrones',2011);

Running query in 'sqlite:///MyDataBase.db'

5 rows affected.

++
||
++
++

In [36]:
%%sql

SELECT * FROM media;

Running query in 'sqlite:///MyDataBase.db'

+----+-----------------------+------+
| id |       production      | year |
+----+-----------------------+------+
| 1  |       Terminator      | 1984 |
| 2  |        Friends        | 1994 |
| 3  |       Toy Story       | 1995 |
| 4  | How I met your mother | 2005 |
| 5  |    Game of thrones    | 2011 |
+----+-----------------------+------+

3. Complete the values on the table `media` that corresponds to your previous inputs on the table `user`.

In [40]:
%%sql

SELECT * FROM media
INNER JOIN user
ON media.id = user.id;

Running query in 'sqlite:///MyDataBase.db'

+----+-----------------------+------+------+--------+-----------------------+------------+
| id |       production      | year | id_1 |  name  |        fullname       |  nickname  |
+----+-----------------------+------+------+--------+-----------------------+------------+
| 1  |       Terminator      | 1984 |  1   | Arnold | Arnold Schwarzenegger | Terminator |
| 2  |        Friends        | 1994 |  2   | Arnold | Arnold Schwarzenegger | Terminator |
| 3  |       Toy Story       | 1995 |  3   | Arnold | Arnold Schwarzenegger | Terminator |
| 4  | How I met your mother | 2005 |  4   | Arnold | Arnold Schwarzenegger | Terminator |
| 5  |    Game of thrones    | 2011 |  5   | Arnold | Arnold Schwarzenegger | Terminator |
+----+-----------------------+------+------+--------+-----------------------+------------+

### Well done! Now you have more tools as part of your skillset!

You are also ready for this joke: *An SQL query walks into a bar and sees two tables. He walks up to them and says:*

<img src='https://cdn.dribbble.com/users/1463678/screenshots/3212815/tables-dribbble.png' width = 500px></img>

## Resources:
- [Introduction to Relational Databases in Python (DataCamp)](https://app.datacamp.com/learn/courses/introduction-to-relational-databases-in-python)
- [ORM For Python: SQLAlchemy 101](https://medium.com/@haataa/orm-for-python-sqlalchemy-101-with-code-example-60868e65b0c)
- [Read the docs](https://docs.sqlalchemy.org/en/14/orm/mapping_styles.html)
- [Tutorial FastAPI and working with databases](https://fastapi.tiangolo.com/tutorial/sql-databases/)
- [SQL query practice](https://www.sql-practice.com/)
- [SQL workshop](https://tdmdal.github.io/mma-sql/)